Documents/бит_бу_ОплатаБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_ОплатаБиллинговыхУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_бу_СведенияОБиллинговыхУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_СведенияОБиллинговыхУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_бу_БиллинговыеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_бу_БиллинговыеУслуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_бу_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ШаблоныИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныИзвещений</Name>
			<Comment>Шаблоны извещений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сальдо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_бу_ОплатаБиллинговыхУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура УдалитьПустыеСтроки()
	
	КоличествоЗаписей = Объект.СписокУслуг.Количество();
	
	Для Ном = 1 По КоличествоЗаписей Цикл
		
		СтрокаТаблицы = Объект.СписокУслуг[КоличествоЗаписей - Ном];
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			
			Объект.СписокУслуг.Удалить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

// Процедура выполняет заполнение таблицы услуг при вводе оплаты вручную.
//
&НаКлиенте
Процедура ЗаполнитьСписокУслугПоШаблону(СтрокаТЧ)
	
	ПоВсемУслугам    = ?(СтрокаТЧ.ШаблонИзвещений = мКэшЗначений.ПоВсемУслугам, Истина, Ложь);
	ОтборУслугМассив = СтрокаТЧ.ШаблонИзвещений.Услуги.ВыгрузитьКолонку("Услуга");
	ШаблонУслуг      = ПолучитьСписокБиллинговыхУслуг(СтрокаТЧ.ЛицевойСчет, ОтборУслугМассив, ПоВсемУслугам);
	
	Для каждого СтрокаУслуга Из ШаблонУслуг Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет"      , СтрокаТЧ.ЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений"  , СтрокаТЧ.ШаблонИзвещений);
		Отбор.Вставить("Услуга", СтрокаУслуга.Значение);
		
		МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() = 0 Тогда
			
			НовСтрока = Объект.СписокУслуг.Добавить();
			
			НовСтрока.Услуга            = СтрокаУслуга.Значение;
			НовСтрока.ЛицевойСчет       = СтрокаТЧ.ЛицевойСчет;
			НовСтрока.ШаблонИзвещений   = СтрокаТЧ.ШаблонИзвещений;
			НовСтрока.Приоритет         = СтрокаУслуга.Значение.Приоритет;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Объект.СписокУслуг.Сортировать("Приоритет Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНадписей()
	
	Если Объект.ВводВРучную Тогда
		
		СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
		
		Объект.СуммаДокумента = Объект.СписокЛС.Итог("Сумма");
		
		Если СтрокаТаблицы <> Неопределено Тогда
			
			КонтрольнаяСумма = СтрокаТаблицы.Сумма;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЛицевойСчет"    , СтрокаТаблицы.ЛицевойСчет);
			Отбор.Вставить("ШаблонИзвещений", СтрокаТаблицы.ШаблонИзвещений);
			
			МассивСтрок = Объект.СписокУслуг.НайтиСтроки(Отбор);
			
			ИтогСумма = 0;
			
			Для каждого ЭлементМассива Из МассивСтрок Цикл
				
				ИтогСумма = ИтогСумма + ЭлементМассива.Сумма;
				
			КонецЦикла;
			
			Остаток = КонтрольнаяСумма - ИтогСумма;
			
			Текст = "Оплата услуг :" + ИтогСумма + ?(Остаток > 0, ". 
			|Не распределенная сумма оплаты: "+ Остаток ,".");
			
			Если Остаток < 0 Тогда
				
				Элементы.НадписьИнфо.ЦветТекста = Новый Цвет(255, 0, 0);		
				Текст = Текст + ". 
				|Распределенная сумма превышает сумму оплаты!"
			Иначе
				Элементы.НадписьИнфо.ЦветТекста = Новый Цвет(0, 0, 0);
				
			КонецЕсли; 
			
			Элементы.НадписьИнфо.Заголовок = Текст;
			
		КонецЕсли; 
		
		Если СтрокаТаблицы = Неопределено Тогда
			Текст = "Сумма по документу :" + Объект.СуммаДокумента;
		Иначе
			Текст ="Сумма по документу :" + Объект.СуммаДокумента + ". 
			|Сумма оплаты :" + СтрокаТаблицы.Сумма;
		КонецЕсли; 
		
		Элементы.НадписьИнфоОбщ.Заголовок = Текст;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СписокУслуг.Доступность  = Объект.ВводВРучную;
	Элементы.НадписьИнфо.Видимость    = Объект.ВводВРучную;
	Элементы.НадписьИнфоОбщ.Видимость = Объект.ВводВРучную;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	Попытка
		// МНеРаспределятьОплатуПослеВводаСуммы = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "бит_НеРаспределятьОплатуПослеВводаСуммы");.
		мНеРаспределятьОплатуПослеВводаСуммы = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), "бит_НеРаспределятьОплатуПослеВводаСуммы");
		
	Исключение
		
		мНеРаспределятьОплатуПослеВводаСуммы = Ложь;
		
	КонецПопытки;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	ОбновитьОтображениеНадписей();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры // ПослеЗаписи()

&НаКлиенте
Процедура СписокЛССчетАбонентаПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"СписокЛССубконто" + Постфикс + "1", 
	"СписокЛССубконто" + Постфикс + "2", 
	"СписокЛССубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма)
	
	СтрокаПлатеж = Форма.Объект.СписокЛС.НайтиПоИдентификатору(Форма.Элементы.СписокЛС.ТекущаяСтрока);
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "СписокЛССубконто%Индекс%", ПараметрыДокумента); 
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "СписокЛССубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиенте
Процедура СписокЛСЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Организация)Тогда
		ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	Иначе
		Текст = "Перед выбором лицевого счета, укажите: Организация";
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить(Текст, СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугБиллинговаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	ЛицевойСчет          = СтрокаТаблицы.ЛицевойСчет;
	
	СписокБиллинговоыхУслуг = ПолучитьСписокБиллинговыхУслуг(ЛицевойСчет);
	СтркутураОтбора = Новый Структура("Ссылка", СписокБиллинговоыхУслуг); 
	
	ОткрытьФорму("Справочник.бит_бу_БиллинговыеУслуги.ФормаВыбора", Новый Структура("Отбор", СтркутураОтбора),Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокБиллинговыхУслуг(ЛицевойСчет, ОтборУслугСписок = Неопределено, ПоВсемУслугам = Истина)
	
	СписокБиллинговоыхУслуг = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	
	УсловиеУслуг = "";
	
	Если НЕ ПоВсемУслугам Тогда
		
		УсловиеУслуг = "И Услуга В (&ОтборУслугСписок)";
		Запрос.УстановитьПараметр("ОтборУслугСписок", ОтборУслугСписок);
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(&КонецПериода, ЛицевойСчет = &ЛицевойСчет "+ УсловиеУслуг +") КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокБиллинговоыхУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокБиллинговоыхУслуг;
	
КонецФункции // ПолучитьСписокБиллинговыхУслуг()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	КэшированныеЗначения.Вставить("ПоВсемУслугам"       , Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиенте
Процедура ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводВРучнуюПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Перед вводом оплаты в ручную - распроведите документ.", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед вводом оплаты в ручную - распроведите документ.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Объект.ВводВРучную = Ложь;
		Возврат;
		
	КонецЕсли; 
	
	ЗаполнениеТаблицыУслуг();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект.Проведен Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Перед изменением таблицы лицевых счетов - распроведите документ", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередУдалением(Элемент, Отказ)
	
	Если Объект.Проведен Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Перед изменением таблицы лицевых счетов - распроведите документ", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		УдалитьСтроки = ПолучитьРазрешениеНаУдалениеСтрок(СтрокаТаблицы, "СписокЛС");
		
		Если УдалитьСтроки Тогда
			ВыподнитьУдалениеСтрок(СтрокаТаблицы, "СписокУслуг"); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриАктивизацииСтроки(Элемент)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	Если СтрокаТаблицы <> Неопределено Тогда
		УстановитьОтборСписокУслуг(СтрокаТаблицы);
	КонецЕсли;
	
	ОбновитьОтображениеНадписей();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписокУслуг(СтрокаТаблицы)
	
	Если Не СтрокаТаблицы = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет"    , СтрокаТаблицы.ЛицевойСчет);
		Отбор.Вставить("ШаблонИзвещений", СтрокаТаблицы.ШаблонИзвещений);
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура(Отбор);
		
		Элементы.СписокУслуг.ОтборСтрок = СтруктураОтбора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьОтборСписокУслуг(СтрокаТаблицы);
	
	Если НЕ Объект.Проведен Тогда
		
		Если Объект.ВводВРучную Тогда
			
			Если СтрокаТаблицы <> Неопределено Тогда
				
				ЗаполнитьСписокУслугПоШаблону(СтрокаТаблицы);
				
			КонецЕсли; 
			
		Иначе 
			
			Если НЕ Объект.Проведен Тогда
				
				Если Не мНеРаспределятьОплатуПослеВводаСуммы Тогда
					ВызватьРасчет();
				КонецЕсли; 
				
				СуммаДокумента = Объект.СписокЛС.Итог("Сумма");
				
				УдалитьПустыеСтроки();
				
			КонецЕсли; 
		КонецЕсли;
		
		ВызватьЗаполнениеСчетов();
		
	КонецЕсли;
	
	Если СтрокаТаблицы <> Неопределено И Объект.Проведен Тогда
		
		Если СтрокаТаблицы.ЛицевойСчет <> мЛицевойСчет Тогда
			СтрокаТаблицы.ЛицевойСчет = мЛицевойСчет;
			ОтменаРедактирования      = Истина;
		КонецЕсли; 
		
		Если СтрокаТаблицы.ШаблонИзвещений <> мШаблонИзвещений Тогда
			СтрокаТаблицы.ШаблонИзвещений = мШаблонИзвещений;
			ОтменаРедактирования          = Истина;
		КонецЕсли; 
		
		Если СтрокаТаблицы.Сумма <> мСумма Тогда
			СтрокаТаблицы.Сумма  = мСумма;
			ОтменаРедактирования = Истина;
		КонецЕсли; 
		
		Если ОтменаРедактирования Тогда
			
			// БИТ_ЖКХ 03.03.2015{{
			// Сообщить("Перед изменением таблицы лицевых счетов - распроведите документ", СтатусСообщения.Информация);.
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
			Сообщение.Сообщить();
			// БИТ_ЖКХ 03.03.2015}}
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВызватьЗаполнениеСчетов()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ЗапролнитьСчета();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СписокЛС.Очистить();
	Объект.СписокУслуг.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Проведен Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Перед изменением таблицы лицевых счетов - распроведите документ", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		СтандартнаяОбработка = Ложь;
	Иначе
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОплатыПриИзменении(Элемент)
	
	ВызватьЗаполнениеСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПередНачаломИзменения(Элемент, Отказ)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	Если СтрокаТаблицы <> неопределено Тогда
		
		мЛицевойСчет     = СтрокаТаблицы.ЛицевойСчет;
		мШаблонИзвещений = СтрокаТаблицы.ШаблонИзвещений;
		мСумма           = СтрокаТаблицы.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТаблиы = Элементы.СписокЛС.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = НЕ Объект.ВводВРучную;
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередУдалением(Элемент, Отказ)
	Отказ = НЕ Объект.ВводВРучную;
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПриИзменении(Элемент)
	ОбновитьОтображениеНадписей();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСПриИзменении(Элемент)
	ОбновитьОтображениеНадписей();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСШаблонИзвещенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВводВРучную Тогда
		
		СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
		
		Если НЕ ВыбранноеЗначение = СтрокаТаблицы.ШаблонИзвещений Тогда
			
			СтандартнаяОбработка = Ложь;
			
			УдалитьСтроки = ПолучитьРазрешениеНаУдалениеСтрок(СтрокаТаблицы, "СписокЛС");
			
			Если УдалитьСтроки Тогда
				ВыподнитьУдалениеСтрок(СтрокаТаблицы, "СписокУслуг"); 
			КонецЕсли;
			
			СтрокаТаблицы.ШаблонИзвещений = ВыбранноеЗначение;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВводВРучную Тогда
		
		СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
		
		Если НЕ ВыбранноеЗначение = СтрокаТаблицы.ЛицевойСчет Тогда
			
			СтандартнаяОбработка = Ложь;
			
			УдалитьСтроки = ПолучитьРазрешениеНаУдалениеСтрок(СтрокаТаблицы, "СписокЛС");
			
			Если УдалитьСтроки Тогда
				ВыподнитьУдалениеСтрок(СтрокаТаблицы, "СписокУслуг"); 
			КонецЕсли;
			
			СтрокаТаблицы.ЛицевойСчет = ВыбранноеЗначение;
			
			СписокЛСЛицевойСчетПриИзменении(Элемент);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	УстановитьОтборСписокУслуг(СтрокаТаблицы);
	
	ВызватьЗаполнениеСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыподнитьУдалениеСтрок(СтрокаТаблицы, Таблица)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЛицевойСчет"    , СтрокаТаблицы.ЛицевойСчет);
	Отбор.Вставить("ШаблонИзвещений", СтрокаТаблицы.ШаблонИзвещений);
	
	МассивСтрок = Объект[Таблица].НайтиСтроки(Отбор);
	
	Для каждого Строка Из МассивСтрок Цикл
		
		Объект[Таблица].Удалить(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазрешениеНаУдалениеСтрок(СтрокаТаблицы, Таблица)
	
	УдалитьСтроки = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЛицевойСчет"    , СтрокаТаблицы.ЛицевойСчет);
	Отбор.Вставить("ШаблонИзвещений", СтрокаТаблицы.ШаблонИзвещений);
	
	МассивСтрок = Объект[Таблица].НайтиСтроки(Отбор);
	
	Для каждого Строка Из МассивСтрок Цикл
		
		Если Строка.НомерСтроки = СтрокаТаблицы.НомерСтроки Тогда
			
			УдалитьСтроки = Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат УдалитьСтроки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеТаблицыУслуг()
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;	
	
	Если Объект.СписокЛС.Количество() > 0 И НЕ Объект.ВводВРучную Тогда
		
		Объект.СписокУслуг.Очистить();
		Если Не мНеРаспределятьОплатуПослеВводаСуммы Тогда
			ВызватьРасчет();
		КонецЕсли; 
		
		УдалитьПустыеСтроки();
		
	ИначеЕсли Объект.СписокЛС.Количество() > 0 И Объект.ВводВРучную Тогда
		
		Объект.СписокУслуг.Очистить();
		
		Для каждого Строка Из Объект.СписокЛС Цикл
			
			ЗаполнитьСписокУслугПоШаблону(Строка);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	УстановитьОтборСписокУслуг(СтрокаТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура ВызватьРасчет()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ВыполнитьРасчет();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугБиллинговаяУслугаПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		СтрокаТаблицы.Приоритет = СтрокаТаблицы.Услуга.Приоритет;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	ВызватьРасчет();
	УдалитьПустыеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССуммаПриИзменении(Элемент)
	
	Элементы.СписокЛС.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

#КонецОбласти
